src/InformationRegisters/СК_БлокировкаСекций/СК_БлокировкаСекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_БлокировкаСекций</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>EnumRef.СК_СтатусыБлокировокСекций</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СК_СтатусыБлокировокСекций/СК_СтатусыБлокировокСекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СК_СтатусыБлокировокСекций</name>
  <enumValues>
    <name>Заблокировано</name>
  </enumValues>
  <enumValues>
    <name>Расчет</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/СК_ОбщийМодульЯчейки/Module.bsl
Функция ДокументСписание(Распоряжение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	СК_СписаниеСклад.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	|ГДЕ
	|	СК_СписаниеСклад.ДокументОснования = &ДокументОснования
	|	И СК_СписаниеСклад.Проведен = &Проведен
	|	И СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления";	
	
	Запрос.УстановитьПараметр("ДокументОснования", Распоряжение);
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции 

Функция ПроверитьБлокировкуСекции(Секция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_БлокировкаСекций.Блокировка КАК Блокировка
	               |ИЗ
	               |	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	               |ГДЕ
	               |	СК_БлокировкаСекций.Секция = &Секция
	               |	И СК_БлокировкаСекций.Блокировка = ЗНАЧЕНИЕ(Перечисление.СК_СтатусыБлокировокСекций.Заблокировано)"; 

	Запрос.УстановитьПараметр("Секция",Секция); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьБлокировкуТовара(ТабТовара) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	СК_БлокировкаСекций.Секция КАК Секция,
|	СК_ТоварыНаСкладахОстатки.Ячейка.Секция КАК ЯчейкаСекция
|ИЗ
|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
|		ПО СК_ТоварыНаСкладахОстатки.Ячейка.Секция = СК_БлокировкаСекций.Секция
|ГДЕ
|	СК_ТоварыНаСкладахОстатки.Номенклатура В (&Номенклатура)
|	И СК_БлокировкаСекций.Блокировка = Значение(Перечисление.СК_СтатусыБлокировокСекций.Заблокировано)"; 

	Запрос.УстановитьПараметр("Номенклатура",ТабТовара); 
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
